Tester/src/Catalogs/ErrorLog/ErrorLog.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ErrorLog</name>
  <attributes>
    <name>Application</name>
    <type>
      <types>CatalogRef.Applications</types>
    </type>
  </attributes>
  <attributes>
    <name>Area</name>
    <type>
      <types>CatalogRef.Areas</types>
    </type>
  </attributes>
  <attributes>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>FullText</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Job</name>
    <type>
      <types>DocumentRef.Job</types>
    </type>
  </attributes>
  <attributes>
    <name>Line</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Row</name>
    <type>
      <types>DefinedType.LineNumber</types>
    </type>
  </attributes>
  <attributes>
    <name>Scenario</name>
    <type>
      <types>CatalogRef.Versions</types>
      <types>CatalogRef.Scenarios</types>
    </type>
  </attributes>
  <attributes>
    <name>Screenshot</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ScreenshotExists</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Session</name>
    <type>
      <types>CatalogRef.Sessions</types>
    </type>
  </attributes>
  <attributes>
    <name>Source</name>
    <type>
      <types>CatalogRef.Scenarios</types>
    </type>
  </attributes>
  <attributes>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Module</name>
    <attributes>
      <name>Calling</name>
      <type>
        <types>CatalogRef.Versions</types>
        <types>CatalogRef.Scenarios</types>
      </type>
    </attributes>
    <attributes>
      <name>Level</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Line</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Row</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Scenario</name>
      <type>
        <types>CatalogRef.Versions</types>
        <types>CatalogRef.Scenarios</types>
      </type>
    </attributes>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.Module</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Stack</name>
    <attributes>
      <name>Area</name>
      <type>
        <types>CatalogRef.Areas</types>
      </type>
    </attributes>
    <attributes>
      <name>Row</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Scenario</name>
      <type>
        <types>CatalogRef.Versions</types>
        <types>CatalogRef.Scenarios</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Tester/src/Enums/Module/Module.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Module</name>
  <enumValues>
    <name>Code</name>
  </enumValues>
  <enumValues>
    <name>Comment</name>
  </enumValues>
  <enumValues>
    <name>EndProcedure</name>
  </enumValues>
  <enumValues>
    <name>EndRegion</name>
  </enumValues>
  <enumValues>
    <name>Error</name>
  </enumValues>
  <enumValues>
    <name>Procedure</name>
  </enumValues>
  <enumValues>
    <name>Region</name>
  </enumValues>
  <enumValues>
    <name>Valve</name>
  </enumValues>
</mdclass:Enum>

Tester/src/Catalogs/ErrorLog/ObjectModule.bsl
var DebuggerStack;
var ProcedureStarts;
var ProcedureEnds;
var RegionStarts;
var RegionEnds;
var Exp;
var Script;
var Deep;
var Floor;
var Entry;
var CurrentLine;

Function Compose ( Debug, Error, Picture ) export
	
	DebuggerStack = RuntimeSrv.Stack ( Debug );
	Date = CurrentSessionDate ();
	Scenario = DebuggerStack.Scenario;
	msg = completeError ( DebuggerStack, Error );
	Description = msg.Short;
	FullText = msg.Long;
	Session = SessionParameters.Session;
	Line = DebuggerStack.Line;
	User = SessionParameters.User;
	data = RuntimeSrv.GetSource ( Scenario );
	Source = data.Scenario;
	Application = data.Application;
	if ( Picture <> undefined ) then
		Screenshot = new ValueStorage ( Picture );
		ScreenshotExists = true;
	endif; 
	jobData = Debug.Job;
	RuntimeSrv.AssignJob ( ThisObject, jobData );
	loadStack ();
	loadModule ();
	Write ();
	RuntimeSrv.WriteError ( data, Scenario, Date, Ref, Debug.Level, jobData );
	return Ref;
	
EndFunction

Function completeError ( Stack, Error )
	
	p = new Structure ();
	p.Insert ( "Message", Error );
	p.Insert ( "Line", stack.Line );
	p.Insert ( "Stack", stack.Source );
	prefix = Output.RuntimeMessagePrefix ( p );
	body = Output.RuntimeMessage ( p );
	long = prefix + body;
	//@skip-warning
	max = Metadata.Catalogs.ErrorLog.StandardAttributes.Description.Type.StringQualifiers.Length;
	tooLong = StrLen ( long ) > max;
	if ( tooLong ) then
		cutPrefix = Output.RuntimeMessageCutPrefix ();
		rest = max - StrLen ( prefix ) - StrLen ( cutPrefix );
		short = prefix + cutPrefix + Right ( long, rest );
	else
		short = long;
	endif;
	return new Structure ( "Long, Short", long, short );
	
EndFunction 

Procedure loadStack ()
	
	firstArea = undefined;
	for each call in DebuggerStack.Calls do
		newRow = Stack.Insert ( 0 );
		newRow.Row = call.Row;
		newRow.Scenario = call.Scenario;
		fall = findArea ( call );
		newRow.Area = fall;
		if ( firstArea = undefined
			and fall <> undefined ) then
			firstArea = fall;
		endif;
	enddo; 
	Area = fall;
	
EndProcedure

Function findArea ( Call )
	
	Script = CachedCalls.DF_Pick ( Call.Scenario, "Script" );
	CurrentLine = Call.Row;
	while ( CurrentLine > 1 ) do
		CurrentLine = CurrentLine - 1;
		span = StrGetLine ( Script, CurrentLine );
		fall = Lexer.AreaComment ( Exp, span );
		if ( fall = undefined ) then
			fall = Lexer.DeclarationName ( Exp, span );
		endif;
		if ( fall <> undefined ) then
			return getArea ( fall );
		endif;
	enddo;
	
EndFunction

Function getArea ( Fall )
	
	item = Catalogs.Areas.FindByDescription ( Fall, true );
	if ( item.IsEmpty () ) then
		obj = Catalogs.Areas.CreateItem ();
		obj.Description = Fall;
		obj.Write ();
		item = obj.Ref;
	endif;
	return item;
	
EndFunction

Procedure loadModule ()
	
	Deep = Stack.Count ();
	Floor = 0;
	while ( Deep > 0 ) do
		Deep = Deep - 1;
		Floor = Floor + 1;
		Entry = Stack [ Deep ];
		Script = CachedCalls.DF_Pick ( Entry.Scenario, "Script" );
		for CurrentLine = contextBegins () to Entry.Row do
			loadScript ();
		enddo;
	enddo;
	
EndProcedure

Function contextBegins ()
	
	insideProcedure = Floor > 1
	and Stack [ Deep ].Scenario = Stack [ Deep + 1 ].Scenario;
	if ( insideProcedure ) then
		begin = Entry.Row;
		while ( begin > 1 ) do
			begin = begin - 1;
			if ( imProcedure ( begin ) ) then
				return begin;
			endif;
		enddo;
	endif;
	return 1;
	
EndFunction

Function imProcedure ( LineNumber )
	
	normal = TrimL ( Lower ( StrGetLine ( Script, LineNumber ) ) );
	return Lexer.Declaration ( procedureStarts, normal ) <> undefined;
	
EndFunction

Procedure loadScript ()
	
	newRow = Module.Add ();
	newRow.Level = Floor;
	stackScenario = Entry.Scenario;
	newRow.Scenario = stackScenario;
	newRow.Line = CurrentLine;
	span = StrGetLine ( Script, CurrentLine );
	if ( CurrentLine = Entry.Row ) then
		newRow.Type = Enums.Module.Error;
		indent = Left ( span, StrFind ( span, TrimL ( span ) ) - 1 );
		if ( Deep = 0 ) then
			newRow.Row = span + Chars.LF + indent + FullText;
		else
			newRow.Row = span;
			newRow = Module.Add ();
			newRow.Level = Floor;
			newRow.Line = CurrentLine;
			calling = Stack [ Deep - 1 ].Scenario;
			newRow.Row = indent + calling;
			newRow.Scenario = stackScenario;
			newRow.Type = Enums.Module.Valve;
			newRow.Calling = calling;
		endif;
	else
		newRow.Row = span;
		normal = TrimL ( Lower ( span ) );
		if ( Lexer.IsComment ( normal ) ) then
			newRow.Type = Enums.Module.Comment;
		elsif ( Lexer.Declaration ( procedureStarts, normal ) <> undefined ) then
			newRow.Type = Enums.Module.Procedure;
		elsif ( Lexer.DeclarationEnds ( Exp, procedureEnds, normal ) ) then
			newRow.Type = Enums.Module.EndProcedure;
		elsif ( Lexer.Declaration ( regionStarts, normal ) <> undefined ) then
			newRow.Type = Enums.Module.Region;
		elsif ( Lexer.DeclarationEnds ( Exp, regionEnds, normal ) ) then
			newRow.Type = Enums.Module.EndRegion;
		endif;
	endif;
	
EndProcedure

// *****************************************
// *********** Variables Initialization

Lexer.ProcedureDescriptors ( ProcedureStarts, ProcedureEnds );
Lexer.RegionDescriptors ( RegionStarts, RegionEnds );
Exp = Regexp.Get ();
